app/Controllers/admin/ShopAdminController.php

SELECT *
FROM `vendors`
---
    public function vendor(): string
    {   $data['vendors']=$this->VendorModel->findAll();