app/Controllers/admin/User.php

INSERT INTO `admins` (`name`, `email`, `password`) VALUES ('Vishal', 'v4516820@gmail.com', '$2y$12$3xqNRunrbnoB7gtc389OEOVb8sZCIuUsKQinQLyDF15ARybfqx0Je')
---
            'created_at' => date('Y-m-d H:i:s')

        ];
        $this->UserModel->insert($newAdmin);

INSERT INTO `vendor_password_reset` (`email`, `otp`, `expires_at`) VALUES ('v4516820@gmail.com', 428933, '2025-08-27 18:30:29')
---
    public function forgotPassword(){
        $emailAddr = $this->request->getPost('email');
        $user=$this->UserModel->where('email',$emailAddr)->first();
        if(!$user){
            return $this->response->setJSON([
                'status'=>'error',
                'message'=>'Email not registered please register'
            ]);
        }
        // Generate verification code
        $verificationCode = random_int(100000, 999999);

        $data=[
            'email'=>$emailAddr,
            'otp' => $verificationCode,
            'expires_at' => date('Y-m-d H:i:s', strtotime('+15 minutes'))
        ];

        $insertId = $this->PasswordReset->insert($data);