app/Controllers/admin/Vendor.php

SELECT COUNT(*) AS `numrows`
FROM `vendors`
---
    public function getVendors()
    {
        $request = service('request');

    $draw   = $request->getVar('draw');
    $start  = $request->getVar('start');
    $length = $request->getVar('length');
    $search = $request->getVar('search')['value'];
        $order   = $request->getVar('order');
    $columns = $request->getVar('columns');
    // Total records
    $totalRecords = $this->VendorModel->countAllResults(false);

    // Filtering
    if (!empty($search)) {
        $this->VendorModel->groupStart()
            ->like('name', $search)
            ->orLike('email', $search)
            ->orLike('phone', $search)
            ->orLike('store_name', $search)
            ->groupEnd();
    }

    $recordsFiltered = $this->VendorModel->countAllResults(false);

SELECT *
FROM `vendors`
 LIMIT 10
---
        $this->VendorModel->orderBy('id', 'DESC');
    }
    // Pagination
    $vendors = $this->VendorModel->findAll($length, $start);