app/Controllers/common/Login.php

    public function ajaxLogin()
    {
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // 🔹 Check Admin
        $admin = $this->adminUserModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'v4516820@gmail.com'
 LIMIT 1